const person = {
  title: "Береговський Василь Васильович",
  position: "Директор, кандидат технічних наук, викладач спец-дисциплін",
  degree: "Кандидат технічних наук",
  education:
    "Львівський політехнічний інститут, 1991 р., Аспірантура національного університету «Львівська політехніка»",
  email: "vasyl.berehovskyi@kep.nung.edu.ua",
  working_since: "У коледжі з 1998 року",
  image: "images/berehovskij.png",
  related: [
    {
      name: 'Циклова комісія "Комп’ютерної інженерії, мехатроніки та кібербезпеки"',
      link: "#",
    },
    {
      name: 'Циклова комісія "Комп’ютерної інженерії, мехатроніки та кібербезпеки"',
      link: "#",
    },
    {
      name: 'Циклова комісія "Комп’ютерної інженерії, мехатроніки та кібербезпеки"',
      link: "#",
    },
  ],
  sections: [
    {
      title: "Освіта та початок кар'єри",
      content:
        "Народився 01.10.1967 року в селі Підшумлянка Галицького району Івано-Франківської області. Після закінчення середньої школи №16 міста Івано-Франківськ навчався у Львівському політехнічному інституті за спеціальністю «Конструювання та технологія виготовлення радіоапаратури». У 1991 році розпочав свою професійну діяльність як інженер-конструктор у СКТБ «Орізон» виробничого об’єднання «Родон».",
    },
    {
      title: "Робота в коледжі",
      content:
        "У 1998 році почав працювати в коледжі на посаді завідувача лабораторії, а вже з 1999 року – викладачем спеціальних дисциплін. У 2004 році був призначений головою циклової комісії «Комп’ютерна інженерія», відповідальною за розвиток навчальних програм та підготовку спеціалістів у цій сфері. З січня 2014 року працював завідувачем економіко-технічного відділення, координуючи навчання за чотирма спеціальностями технічного та економічного напрямків.",
    },
    {
      title: "Наукова діяльність",
      content:
        "Паралельно з роботою в коледжі навчався в аспірантурі Національного університету «Львівська політехніка», де у 2017 році захистив кандидатську дисертацію на тему: “Математичне та програмне забезпечення автоматизованого проектування систем «інтелектуального будинку»” за спеціальністю 05.13.12 «Системи автоматизації проектувальних робіт». Є автором 24 наукових публікацій. З 2017 року працює за сумісництвом доцентом кафедри комп’ютерних систем і мереж ІФНТУНГ.",
    },
    {
      title: "Діяльність на посаді директора",
      content:
        "Керуючи коледжем, забезпечує комфортні умови для розвитку студентів і викладачів. Кожен педагог має можливість творчо працювати та відчувати підтримку з боку мудрого керівника, доброї і порядної людини.",
    },
  ],
  quote:
    "<b>Василь Васильович</b> - керівник, який ніколи не зупиняється на досягнутому, весь час перебуває у творчому пошуку шляхів розвитку закладу освіти та <b>вдосконалення освітнього процесу</b>.",
};

function generateContent(person) {
  const contentDiv = document.getElementById("textContent");
  contentDiv.innerHTML = `
      <h1>${person.title}</h1>
      <p>${person.position}</p>
      <p><b>Науковий ступінь:</b> ${person.degree}</p>
      <p><b>Освіта:</b> ${person.education}</p>
      <p><b>E-mail:</b> <a href="mailto:${person.email}">${person.email}</a></p>
      <p>${person.working_since}</p>
  `;

  const imageWrapper = document.querySelector(".image-wrapper img");
  imageWrapper.src = person.image;
  imageWrapper.alt = `${person.title}`;

  const aboutParagraphs = document.getElementById("paragraphs");
  person.sections.forEach((section) => {
    const sectionHTML = `
        <h2>${section.title}</h2>
        <p>${section.content}</p>
    `;
    aboutParagraphs.innerHTML += sectionHTML;
  });

  const menuDiv = document.querySelector("#menu");
  const ul = menuDiv.querySelector("ul");

  person.related.forEach((item) => {
    const listItemHTML = `
            <li>
                <a href="${item.link}">${item.name}</a>
            </li>
        `;
    ul.innerHTML += listItemHTML;
  });

  const quoteSection = document.querySelector(".quote-section .quote");
  quoteSection.innerHTML = `
        <i class="fa-solid fa-quote-left"></i>
        ${person.quote}
        <i class="fa-solid fa-quote-right"></i>
    `;
}

generateContent(person);
