[{
    "title": "Береговський Василь Васильович",
    "position": "Директор, кандидат технічних наук, викладач спец-дисциплін",
    "degree": "Кандидат технічних наук",
    "education": "Львівський політехнічний інститут, 1991 р., Аспірантура національного університету «Львівська політехніка»",
    "email": "vasyl.berehovskyi@kep.nung.edu.ua",
    "working_since": "У коледжі з 1998 року",
    "image": "images/berehovskij.png",
    "related": [
      { "name": "Циклова комісія \"Комп’ютерної інженерії, мехатроніки та кібербезпеки\"", "link": "#" },
      { "name": "Циклова комісія \"Комп’ютерної інженерії, мехатроніки та кібербезпеки\"", "link": "#" },
      { "name": "Циклова комісія \"Комп’ютерної інженерії, мехатроніки та кібербезпеки\"", "link": "#" }
    ],
    "sections": [
      {
        "title": "Освіта та початок кар'єри",
        "content": "Народився 01.10.1967 року в селі Підшумлянка Галицького району Івано-Франківської області. Після закінчення середньої школи №16 міста Івано-Франківськ навчався у Львівському політехнічному інституті за спеціальністю «Конструювання та технологія виготовлення радіоапаратури». У 1991 році розпочав свою професійну діяльність як інженер-конструктор у СКТБ «Орізон» виробничого об’єднання «Родон»."
      },
      {
        "title": "Робота в коледжі",
        "content": "У 1998 році почав працювати в коледжі на посаді завідувача лабораторії, а вже з 1999 року – викладачем спеціальних дисциплін. У 2004 році був призначений головою циклової комісії «Комп’ютерна інженерія», відповідальною за розвиток навчальних програм та підготовку спеціалістів у цій сфері. З січня 2014 року працював завідувачем економіко-технічного відділення, координуючи навчання за чотирма спеціальностями технічного та економічного напрямків."
      },
      {
        "title": "Наукова діяльність",
        "content": "Паралельно з роботою в коледжі навчався в аспірантурі Національного університету «Львівська політехніка», де у 2017 році захистив кандидатську дисертацію на тему: “Математичне та програмне забезпечення автоматизованого проектування систем «інтелектуального будинку»” за спеціальністю 05.13.12 «Системи автоматизації проектувальних робіт». Є автором 24 наукових публікацій. З 2017 року працює за сумісництвом доцентом кафедри комп’ютерних систем і мереж ІФНТУНГ."
      },
      {
        "title": "Діяльність на посаді директора",
        "content": "Керуючи коледжем, забезпечує комфортні умови для розвитку студентів і викладачів. Кожен педагог має можливість творчо працювати та відчувати підтримку з боку мудрого керівника, доброї і порядної людини."
      }
    ],
    "quote": "<b>Василь Васильович</b> - керівник, який ніколи не зупиняється на досягнутому, весь час перебуває у творчому пошуку шляхів розвитку закладу освіти та <b>вдосконалення освітнього процесу</b>."
  },
  {
    "title": "Малик Іван Васильович",
    "position": "Заступник директора з навчальної роботи, кандидат філософських наук",
    "degree": "Кандидат філософських наук",
    "education": "Київський державний педагогічний інститут ім. Горького (НПУ ім. М.П. Драгоманова), аспірантура НПУ ім. М.П. Драгоманова",
    "email": "",
    "working_since": "У коледжі з 1990 року",
    "image": "images/malyk.png",
    "related": [
      { "name": "Кафедра філософії та педагогіки", "link": "#" },
      { "name": "Національний педагогічний університет ім. М.П. Драгоманова", "link": "#" },
      { "name": "Івано-Франківський національний технічний університет нафти і газу", "link": "#" }
    ],
    "sections": [
      {
        "title": "Освіта та початок кар'єри",
        "content": "Народився 30 травня 1959 року в селищі Чернелиця Городенківського району. Після закінчення школи навчався в Київському державному педагогічному інституті ім. Горького на спеціальності 'Історія, суспільствознавство, методика виховної роботи'."
      },
      {
        "title": "Робота в коледжі",
        "content": "З 1990 року працював заступником директора з виховної роботи, а з 1996 року - заступником директора з навчальної роботи."
      },
      {
        "title": "Наукова діяльність",
        "content": "У 2008 році захистив кандидатську дисертацію 'Філософський дискурс технократизму в освітніх концепціях ХХІ'. Автор та співавтор кількох наукових монографій і статей."
      },
      {
        "title": "Діяльність у вищій освіті",
        "content": "З 2009 по 2018 роки працював доцентом на кафедрах ІФНТУНГ та НТУ, викладаючи філософію та педагогіку."
      }
    ],
    "quote": "Переконаний, що освіта – це навчання і виховання у їх безперервній взаємодії."
    },
    {
        "title": "Вовк Ірина Іванівна",
        "position": "Заступник директора з навчально-виробничої роботи",
        "degree": "",
        "education": "Коледж електронних приладів ІФНТУНГ (2006), Приватний ВНЗ «Галицька академія» (2010)",
        "email": "",
        "working_since": "У коледжі з 2006 року",
        "image": "images/vovk.png",
        "related": [
          { "name": "Кафедра комп'ютерних дисциплін", "link": "#" },
          { "name": "Навчально-виробнича практика", "link": "#" },
          { "name": "Галицька академія", "link": "#" }
        ],
        "sections": [
          {
            "title": "Освіта та початок кар'єри",
            "content": "Закінчила Коледж електронних приладів ІФНТУНГ у 2006 році за спеціальністю 'Програмування для електроннообчислювальної техніки і автоматизованих систем'. У 2010 році отримала кваліфікацію інженера-програміста в Приватному ВНЗ «Галицька академія»."
          },
          {
            "title": "Робота в коледжі",
            "content": "З 2006 року працювала секретарем навчальної частини, з 2013 року – завідувачем навчально-виробничої практики, викладачем комп'ютерних дисциплін. У 2020 році призначена заступником директора з навчально-виробничої роботи."
          },
          {
            "title": "Методична діяльність",
            "content": "Співавтор методичних рекомендацій для керівників практик «Вимоги до організації та проведення практики». Працює над створенням сучасних навчальних кабінетів, лабораторій, майстерень."
          },
          {
            "title": "Співпраця з підприємствами",
            "content": "Підтримує зв’язок із підприємствами області та регіону для організації практик та працевлаштування студентів."
          }
        ],
        "quote": "Студент – це не посудина, яку потрібно заповнити, студент – факел, який треба запалити."
    },
    {
        "title": "Кучеренко Оксана Іванівна",
        "position": "Заступник директора з виховної роботи",
        "degree": "",
        "education": "Коледж електронних приладів ІФНТУНГ (2002), Приватний ВНЗ «Галицька академія» (2012)",
        "email": "",
        "working_since": "У коледжі з 2005 року",
        "image": "images/kucherenko.png",
        "related": [
          { "name": "Кафедра комп'ютерних наук", "link": "#" },
          { "name": "Виховна робота", "link": "#" },
          { "name": "Приймальна комісія", "link": "#" }
        ],
        "sections": [
          {
            "title": "Освіта та початок кар'єри",
            "content": "Закінчила Коледж електронних приладів ІФНТУНГ у 2002 році за спеціальністю 'Програмування для електронно-обчислювальної техніки і автоматизованих систем'. У 2012 році отримала кваліфікацію професіонала у галузі програмування в Приватному ВНЗ «Галицька академія»."
          },
          {
            "title": "Робота в коледжі",
            "content": "З 2005 року працювала бібліотекарем, з 2012 року – викладачем спеціальних дисциплін напряму «Комп’ютерні науки». У 2020 році стала відповідальним секретарем приймальної комісії, а у вересні 2020 року призначена заступником директора з виховної роботи."
          },
          {
            "title": "Науково-методична діяльність",
            "content": "Співрозробник освітньо-професійних програм для спеціальності 151: «Автоматизація та комп’ютерно-інтегровані технології» та «Комп’ютерно-інтегровані технології та прикладне програмування»."
          },
          {
            "title": "Педагогічні принципи",
            "content": "Вважає, що кожен студент має потенціал для розвитку, і завдання педагога – допомогти йому розкритися, сформувати активну життєву позицію та розвинути здібності."
          }
        ],
        "quote": "Переступаючи поріг коледжу, я усвідомлюю, що приходжу до студентів, щоб розпізнати у кожному з них людську особистість, здатну розвиватись і прогресувати..."
    }
]